In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
string_data = Series(["xenias", "xiphoid", np.nan, "xerus"])
string_data

0     xenias
1    xiphoid
2        NaN
3      xerus
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[5] = None
string_data.isnull()

0    False
1    False
2     True
3    False
5     True
dtype: bool

In [6]:
string_data.fillna("")

0     xenias
1    xiphoid
2
3      xerus
5
dtype: object

In [7]:
string_data.dropna()

0     xenias
1    xiphoid
3      xerus
dtype: object

In [9]:
frame = DataFrame({"one":[1,2,np.nan,5,np.nan], "two":[5,np.nan,4,0,np.nan], "three":[1,2,3,5,np.nan]})
frame

   one  three  two
0  1.0    1.0  5.0
1  2.0    2.0  NaN
2  NaN    3.0  4.0
3  5.0    5.0  0.0
4  NaN    NaN  NaN

In [10]:
frame.dropna()

   one  three  two
0  1.0    1.0  5.0
3  5.0    5.0  0.0

In [11]:
frame.dropna(how="all")

   one  three  two
0  1.0    1.0  5.0
1  2.0    2.0  NaN
2  NaN    3.0  4.0
3  5.0    5.0  0.0

In [21]:
frame = DataFrame({"one":np.random.random(7), "two":np.random.random(7), "three":np.random.random(7)})
frame["one"][2:] = np.nan
frame["two"][3:] = np.nan
frame["three"][1:4] = np.nan
frame

        one     three       two
0  0.180810  0.617557  0.073716
1  0.654223       NaN  0.442707
2       NaN       NaN  0.783427
3       NaN       NaN       NaN
4       NaN  0.383883       NaN
5       NaN  0.370455       NaN
6       NaN  0.885425       NaN

In [24]:
# Keep all rows with at least one non-null entry
frame.dropna(thresh=1)

        one     three       two
0  0.180810  0.617557  0.073716
1  0.654223       NaN  0.442707
2       NaN       NaN  0.783427
4       NaN  0.383883       NaN
5       NaN  0.370455       NaN
6       NaN  0.885425       NaN

In [25]:
frame.fillna({"one":0, "two":-1})

        one     three       two
0  0.180810  0.617557  0.073716
1  0.654223       NaN  0.442707
2  0.000000       NaN  0.783427
3  0.000000       NaN -1.000000
4  0.000000  0.383883 -1.000000
5  0.000000  0.370455 -1.000000
6  0.000000  0.885425 -1.000000

In [26]:
frame.fillna({"three":2}, inplace=True)
frame

        one     three       two
0  0.180810  0.617557  0.073716
1  0.654223  2.000000  0.442707
2       NaN  2.000000  0.783427
3       NaN  2.000000       NaN
4       NaN  0.383883       NaN
5       NaN  0.370455       NaN
6       NaN  0.885425       NaN

In [27]:
frame.fillna(method="pad", limit=2)

        one     three       two
0  0.180810  0.617557  0.073716
1  0.654223  2.000000  0.442707
2  0.654223  2.000000  0.783427
3  0.654223  2.000000  0.783427
4       NaN  0.383883  0.783427
5       NaN  0.370455       NaN
6       NaN  0.885425       NaN